{"class_name": "Model", "keras_version": "1.2.2", "config": {"layers": [{"class_name": "InputLayer", "config": {"batch_input_shape": [null, 500], "input_dtype": "float32", "sparse": false, "name": "inp_nodes"}, "inbound_nodes": [], "name": "inp_nodes"}, {"class_name": "Dense", "config": {"W_constraint": null, "b_constraint": null, "name": "dense_1", "output_dim": 40, "activity_regularizer": null, "trainable": true, "init": "glorot_uniform", "bias": true, "input_dtype": "float32", "input_dim": 500, "b_regularizer": null, "W_regularizer": null, "activation": "relu", "batch_input_shape": [null, 500]}, "inbound_nodes": [[["inp_nodes", 0, 0]]], "name": "dense_1"}, {"class_name": "InputLayer", "config": {"batch_input_shape": [null, 2, 40], "input_dtype": "float32", "sparse": false, "name": "inp_context_0"}, "inbound_nodes": [], "name": "inp_context_0"}, {"class_name": "GraphHighway", "config": {"W_constraint": null, "b_constraint": null, "name": "graphhighway_1", "transform_bias": -1.0, "activity_regularizer": null, "trainable": true, "n_rel": 2, "b_regularizer": null, "init": "glorot_normal", "bias": true, "input_dtype": "float32", "input_dim": 40, "batch_input_shape": [null, 40], "W_regularizer": null, "activation": "relu", "mean": 2}, "inbound_nodes": [[["dense_1", 0, 0], ["inp_context_0", 0, 0]], [["graphhighway_1", 0, 0], ["inp_context_1", 0, 0]], [["graphhighway_1", 1, 0], ["inp_context_2", 0, 0]], [["graphhighway_1", 2, 0], ["inp_context_3", 0, 0]], [["graphhighway_1", 3, 0], ["inp_context_4", 0, 0]], [["graphhighway_1", 4, 0], ["inp_context_5", 0, 0]], [["graphhighway_1", 5, 0], ["inp_context_6", 0, 0]], [["graphhighway_1", 6, 0], ["inp_context_7", 0, 0]], [["graphhighway_1", 7, 0], ["inp_context_8", 0, 0]], [["graphhighway_1", 8, 0], ["inp_context_9", 0, 0]]], "name": "graphhighway_1"}, {"class_name": "InputLayer", "config": {"batch_input_shape": [null, 2, 40], "input_dtype": "float32", "sparse": false, "name": "inp_context_1"}, "inbound_nodes": [], "name": "inp_context_1"}, {"class_name": "InputLayer", "config": {"batch_input_shape": [null, 2, 40], "input_dtype": "float32", "sparse": false, "name": "inp_context_2"}, "inbound_nodes": [], "name": "inp_context_2"}, {"class_name": "InputLayer", "config": {"batch_input_shape": [null, 2, 40], "input_dtype": "float32", "sparse": false, "name": "inp_context_3"}, "inbound_nodes": [], "name": "inp_context_3"}, {"class_name": "InputLayer", "config": {"batch_input_shape": [null, 2, 40], "input_dtype": "float32", "sparse": false, "name": "inp_context_4"}, "inbound_nodes": [], "name": "inp_context_4"}, {"class_name": "InputLayer", "config": {"batch_input_shape": [null, 2, 40], "input_dtype": "float32", "sparse": false, "name": "inp_context_5"}, "inbound_nodes": [], "name": "inp_context_5"}, {"class_name": "InputLayer", "config": {"batch_input_shape": [null, 2, 40], "input_dtype": "float32", "sparse": false, "name": "inp_context_6"}, "inbound_nodes": [], "name": "inp_context_6"}, {"class_name": "InputLayer", "config": {"batch_input_shape": [null, 2, 40], "input_dtype": "float32", "sparse": false, "name": "inp_context_7"}, "inbound_nodes": [], "name": "inp_context_7"}, {"class_name": "InputLayer", "config": {"batch_input_shape": [null, 2, 40], "input_dtype": "float32", "sparse": false, "name": "inp_context_8"}, "inbound_nodes": [], "name": "inp_context_8"}, {"class_name": "InputLayer", "config": {"batch_input_shape": [null, 2, 40], "input_dtype": "float32", "sparse": false, "name": "inp_context_9"}, "inbound_nodes": [], "name": "inp_context_9"}, {"class_name": "Dense", "config": {"W_constraint": null, "b_constraint": null, "name": "dense_2", "output_dim": 3, "activity_regularizer": null, "trainable": true, "init": "glorot_uniform", "bias": true, "input_dtype": "float32", "input_dim": 40, "b_regularizer": null, "W_regularizer": null, "activation": "linear", "batch_input_shape": [null, 40]}, "inbound_nodes": [[["graphhighway_1", 9, 0]]], "name": "dense_2"}, {"class_name": "Activation", "config": {"activation": "softmax", "trainable": true, "name": "activation_1"}, "inbound_nodes": [[["dense_2", 0, 0]]], "name": "activation_1"}], "input_layers": [["inp_nodes", 0, 0], ["inp_context_0", 0, 0], ["inp_context_1", 0, 0], ["inp_context_2", 0, 0], ["inp_context_3", 0, 0], ["inp_context_4", 0, 0], ["inp_context_5", 0, 0], ["inp_context_6", 0, 0], ["inp_context_7", 0, 0], ["inp_context_8", 0, 0], ["inp_context_9", 0, 0]], "output_layers": [["activation_1", 0, 0]], "name": "model_1"}}