{"class_name": "Model", "keras_version": "1.2.2", "config": {"layers": [{"class_name": "InputLayer", "config": {"batch_input_shape": [null, 32, 32, 3], "input_dtype": "float32", "sparse": false, "name": "inp_nodes"}, "inbound_nodes": [], "name": "inp_nodes"}, {"class_name": "Convolution2D", "config": {"b_regularizer": null, "W_constraint": null, "b_constraint": null, "name": "convolution2d_1", "activity_regularizer": null, "trainable": true, "dim_ordering": "tf", "nb_col": 3, "subsample": [1, 1], "init": "glorot_uniform", "bias": true, "nb_filter": 32, "input_dtype": "float32", "border_mode": "same", "batch_input_shape": [null, 3, 32, 32], "W_regularizer": null, "activation": "relu", "nb_row": 3}, "inbound_nodes": [[["inp_nodes", 0, 0]]], "name": "convolution2d_1"}, {"class_name": "Dropout", "config": {"p": 0.2, "trainable": true, "name": "dropout_1"}, "inbound_nodes": [[["convolution2d_1", 0, 0]]], "name": "dropout_1"}, {"class_name": "Convolution2D", "config": {"W_constraint": null, "b_constraint": null, "name": "convolution2d_2", "activity_regularizer": null, "trainable": true, "dim_ordering": "tf", "nb_col": 3, "subsample": [1, 1], "init": "glorot_uniform", "bias": true, "nb_filter": 32, "border_mode": "same", "b_regularizer": null, "W_regularizer": null, "activation": "relu", "nb_row": 3}, "inbound_nodes": [[["dropout_1", 0, 0]]], "name": "convolution2d_2"}, {"class_name": "MaxPooling2D", "config": {"name": "maxpooling2d_1", "trainable": true, "dim_ordering": "tf", "pool_size": [2, 2], "strides": [2, 2], "border_mode": "valid"}, "inbound_nodes": [[["convolution2d_2", 0, 0]]], "name": "maxpooling2d_1"}, {"class_name": "Convolution2D", "config": {"W_constraint": null, "b_constraint": null, "name": "convolution2d_3", "activity_regularizer": null, "trainable": true, "dim_ordering": "tf", "nb_col": 3, "subsample": [1, 1], "init": "glorot_uniform", "bias": true, "nb_filter": 64, "border_mode": "same", "b_regularizer": null, "W_regularizer": null, "activation": "relu", "nb_row": 3}, "inbound_nodes": [[["maxpooling2d_1", 0, 0]]], "name": "convolution2d_3"}, {"class_name": "Dropout", "config": {"p": 0.2, "trainable": true, "name": "dropout_2"}, "inbound_nodes": [[["convolution2d_3", 0, 0]]], "name": "dropout_2"}, {"class_name": "Convolution2D", "config": {"W_constraint": null, "b_constraint": null, "name": "convolution2d_4", "activity_regularizer": null, "trainable": true, "dim_ordering": "tf", "nb_col": 3, "subsample": [1, 1], "init": "glorot_uniform", "bias": true, "nb_filter": 64, "border_mode": "same", "b_regularizer": null, "W_regularizer": null, "activation": "relu", "nb_row": 3}, "inbound_nodes": [[["dropout_2", 0, 0]]], "name": "convolution2d_4"}, {"class_name": "MaxPooling2D", "config": {"name": "maxpooling2d_2", "trainable": true, "dim_ordering": "tf", "pool_size": [2, 2], "strides": [2, 2], "border_mode": "valid"}, "inbound_nodes": [[["convolution2d_4", 0, 0]]], "name": "maxpooling2d_2"}, {"class_name": "Convolution2D", "config": {"W_constraint": null, "b_constraint": null, "name": "convolution2d_5", "activity_regularizer": null, "trainable": true, "dim_ordering": "tf", "nb_col": 3, "subsample": [1, 1], "init": "glorot_uniform", "bias": true, "nb_filter": 128, "border_mode": "same", "b_regularizer": null, "W_regularizer": null, "activation": "relu", "nb_row": 3}, "inbound_nodes": [[["maxpooling2d_2", 0, 0]]], "name": "convolution2d_5"}, {"class_name": "Dropout", "config": {"p": 0.2, "trainable": true, "name": "dropout_3"}, "inbound_nodes": [[["convolution2d_5", 0, 0]]], "name": "dropout_3"}, {"class_name": "Convolution2D", "config": {"W_constraint": null, "b_constraint": null, "name": "convolution2d_6", "activity_regularizer": null, "trainable": true, "dim_ordering": "tf", "nb_col": 3, "subsample": [1, 1], "init": "glorot_uniform", "bias": true, "nb_filter": 128, "border_mode": "same", "b_regularizer": null, "W_regularizer": null, "activation": "relu", "nb_row": 3}, "inbound_nodes": [[["dropout_3", 0, 0]]], "name": "convolution2d_6"}, {"class_name": "MaxPooling2D", "config": {"name": "maxpooling2d_3", "trainable": true, "dim_ordering": "tf", "pool_size": [2, 2], "strides": [2, 2], "border_mode": "valid"}, "inbound_nodes": [[["convolution2d_6", 0, 0]]], "name": "maxpooling2d_3"}, {"class_name": "Convolution2D", "config": {"W_constraint": null, "b_constraint": null, "name": "convolution2d_7", "activity_regularizer": null, "trainable": true, "dim_ordering": "tf", "nb_col": 3, "subsample": [1, 1], "init": "glorot_uniform", "bias": true, "nb_filter": 256, "border_mode": "same", "b_regularizer": null, "W_regularizer": null, "activation": "relu", "nb_row": 3}, "inbound_nodes": [[["maxpooling2d_3", 0, 0]]], "name": "convolution2d_7"}, {"class_name": "Dropout", "config": {"p": 0.2, "trainable": true, "name": "dropout_4"}, "inbound_nodes": [[["convolution2d_7", 0, 0]]], "name": "dropout_4"}, {"class_name": "Convolution2D", "config": {"W_constraint": null, "b_constraint": null, "name": "convolution2d_8", "activity_regularizer": null, "trainable": true, "dim_ordering": "tf", "nb_col": 3, "subsample": [1, 1], "init": "glorot_uniform", "bias": true, "nb_filter": 256, "border_mode": "same", "b_regularizer": null, "W_regularizer": null, "activation": "relu", "nb_row": 3}, "inbound_nodes": [[["dropout_4", 0, 0]]], "name": "convolution2d_8"}, {"class_name": "MaxPooling2D", "config": {"name": "maxpooling2d_4", "trainable": true, "dim_ordering": "tf", "pool_size": [2, 2], "strides": [2, 2], "border_mode": "valid"}, "inbound_nodes": [[["convolution2d_8", 0, 0]]], "name": "maxpooling2d_4"}, {"class_name": "Flatten", "config": {"trainable": true, "name": "flatten_1"}, "inbound_nodes": [[["maxpooling2d_4", 0, 0]]], "name": "flatten_1"}, {"class_name": "Dropout", "config": {"p": 0.2, "trainable": true, "name": "dropout_5"}, "inbound_nodes": [[["flatten_1", 0, 0]]], "name": "dropout_5"}, {"class_name": "Dense", "config": {"W_constraint": null, "b_constraint": null, "name": "dnscnn3", "activity_regularizer": null, "trainable": true, "init": "glorot_uniform", "bias": true, "input_dim": 1024, "b_regularizer": null, "W_regularizer": null, "activation": "relu", "output_dim": 40}, "inbound_nodes": [[["dropout_5", 0, 0]]], "name": "dnscnn3"}, {"class_name": "Dense", "config": {"W_constraint": null, "b_constraint": null, "name": "dense_1", "activity_regularizer": null, "trainable": true, "init": "glorot_uniform", "bias": true, "input_dim": 40, "b_regularizer": null, "W_regularizer": null, "activation": "relu", "output_dim": 40}, "inbound_nodes": [[["dnscnn3", 0, 0]]], "name": "dense_1"}, {"class_name": "InputLayer", "config": {"batch_input_shape": [null, 2, 40], "input_dtype": "float32", "sparse": false, "name": "inp_context_0"}, "inbound_nodes": [], "name": "inp_context_0"}, {"class_name": "GraphHighway", "config": {"W_constraint": null, "b_constraint": null, "name": "graphhighway_1", "transform_bias": -1.0, "activity_regularizer": null, "trainable": true, "n_rel": 2, "b_regularizer": null, "init": "glorot_normal", "bias": true, "input_dtype": "float32", "input_dim": 40, "batch_input_shape": [null, 40], "W_regularizer": null, "activation": "relu", "mean": 2}, "inbound_nodes": [[["dense_1", 0, 0], ["inp_context_0", 0, 0]], [["graphhighway_1", 0, 0], ["inp_context_1", 0, 0]], [["graphhighway_1", 1, 0], ["inp_context_2", 0, 0]], [["graphhighway_1", 2, 0], ["inp_context_3", 0, 0]], [["graphhighway_1", 3, 0], ["inp_context_4", 0, 0]], [["graphhighway_1", 4, 0], ["inp_context_5", 0, 0]], [["graphhighway_1", 5, 0], ["inp_context_6", 0, 0]], [["graphhighway_1", 6, 0], ["inp_context_7", 0, 0]], [["graphhighway_1", 7, 0], ["inp_context_8", 0, 0]], [["graphhighway_1", 8, 0], ["inp_context_9", 0, 0]]], "name": "graphhighway_1"}, {"class_name": "InputLayer", "config": {"batch_input_shape": [null, 2, 40], "input_dtype": "float32", "sparse": false, "name": "inp_context_1"}, "inbound_nodes": [], "name": "inp_context_1"}, {"class_name": "InputLayer", "config": {"batch_input_shape": [null, 2, 40], "input_dtype": "float32", "sparse": false, "name": "inp_context_2"}, "inbound_nodes": [], "name": "inp_context_2"}, {"class_name": "InputLayer", "config": {"batch_input_shape": [null, 2, 40], "input_dtype": "float32", "sparse": false, "name": "inp_context_3"}, "inbound_nodes": [], "name": "inp_context_3"}, {"class_name": "InputLayer", "config": {"batch_input_shape": [null, 2, 40], "input_dtype": "float32", "sparse": false, "name": "inp_context_4"}, "inbound_nodes": [], "name": "inp_context_4"}, {"class_name": "InputLayer", "config": {"batch_input_shape": [null, 2, 40], "input_dtype": "float32", "sparse": false, "name": "inp_context_5"}, "inbound_nodes": [], "name": "inp_context_5"}, {"class_name": "InputLayer", "config": {"batch_input_shape": [null, 2, 40], "input_dtype": "float32", "sparse": false, "name": "inp_context_6"}, "inbound_nodes": [], "name": "inp_context_6"}, {"class_name": "InputLayer", "config": {"batch_input_shape": [null, 2, 40], "input_dtype": "float32", "sparse": false, "name": "inp_context_7"}, "inbound_nodes": [], "name": "inp_context_7"}, {"class_name": "InputLayer", "config": {"batch_input_shape": [null, 2, 40], "input_dtype": "float32", "sparse": false, "name": "inp_context_8"}, "inbound_nodes": [], "name": "inp_context_8"}, {"class_name": "InputLayer", "config": {"batch_input_shape": [null, 2, 40], "input_dtype": "float32", "sparse": false, "name": "inp_context_9"}, "inbound_nodes": [], "name": "inp_context_9"}, {"class_name": "Dense", "config": {"W_constraint": null, "b_constraint": null, "name": "dense_2", "activity_regularizer": null, "trainable": true, "init": "glorot_uniform", "bias": true, "input_dim": 40, "b_regularizer": null, "W_regularizer": null, "activation": "linear", "output_dim": 85}, "inbound_nodes": [[["graphhighway_1", 9, 0]]], "name": "dense_2"}, {"class_name": "Activation", "config": {"activation": "softmax", "trainable": true, "name": "activation_1"}, "inbound_nodes": [[["dense_2", 0, 0]]], "name": "activation_1"}], "input_layers": [["inp_nodes", 0, 0], ["inp_context_0", 0, 0], ["inp_context_1", 0, 0], ["inp_context_2", 0, 0], ["inp_context_3", 0, 0], ["inp_context_4", 0, 0], ["inp_context_5", 0, 0], ["inp_context_6", 0, 0], ["inp_context_7", 0, 0], ["inp_context_8", 0, 0], ["inp_context_9", 0, 0]], "output_layers": [["activation_1", 0, 0]], "name": "model_1"}}