{"class_name": "Model", "keras_version": "1.2.2", "config": {"layers": [{"class_name": "InputLayer", "config": {"batch_input_shape": [null, 500], "input_dtype": "float32", "sparse": false, "name": "inp_nodes"}, "inbound_nodes": [], "name": "inp_nodes"}, {"class_name": "Dense", "config": {"W_constraint": null, "b_constraint": null, "name": "dense_1", "output_dim": 45, "activity_regularizer": null, "trainable": true, "init": "glorot_uniform", "bias": true, "input_dtype": "float32", "input_dim": 500, "b_regularizer": null, "W_regularizer": null, "activation": "relu", "batch_input_shape": [null, 500]}, "inbound_nodes": [[["inp_nodes", 0, 0]]], "name": "dense_1"}, {"class_name": "InputLayer", "config": {"batch_input_shape": [null, 2, 171], "input_dtype": "int32", "sparse": false, "name": "inp_rel"}, "inbound_nodes": [], "name": "inp_rel"}, {"class_name": "InputLayer", "config": {"batch_input_shape": [null, 2, 2, 171], "input_dtype": "float32", "sparse": false, "name": "inp_rel_mask"}, "inbound_nodes": [], "name": "inp_rel_mask"}, {"class_name": "GraphHighwayByRel", "config": {"W_constraint": null, "b_constraint": null, "name": "graphhighwaybyrel_1", "transform_bias": -1.0, "activity_regularizer": null, "trainable": true, "n_rel": 2, "b_regularizer": null, "init": "glorot_normal", "bias": true, "input_dtype": "float32", "input_dim": 45, "batch_input_shape": [null, 45], "W_regularizer": null, "activation": "relu", "mean": 1}, "inbound_nodes": [[["dense_1", 0, 0], ["inp_rel", 0, 0], ["inp_rel_mask", 0, 0]], [["graphhighwaybyrel_1", 0, 0], ["inp_rel", 0, 0], ["inp_rel_mask", 0, 0]], [["graphhighwaybyrel_1", 1, 0], ["inp_rel", 0, 0], ["inp_rel_mask", 0, 0]], [["graphhighwaybyrel_1", 2, 0], ["inp_rel", 0, 0], ["inp_rel_mask", 0, 0]], [["graphhighwaybyrel_1", 3, 0], ["inp_rel", 0, 0], ["inp_rel_mask", 0, 0]], [["graphhighwaybyrel_1", 4, 0], ["inp_rel", 0, 0], ["inp_rel_mask", 0, 0]], [["graphhighwaybyrel_1", 5, 0], ["inp_rel", 0, 0], ["inp_rel_mask", 0, 0]], [["graphhighwaybyrel_1", 6, 0], ["inp_rel", 0, 0], ["inp_rel_mask", 0, 0]], [["graphhighwaybyrel_1", 7, 0], ["inp_rel", 0, 0], ["inp_rel_mask", 0, 0]], [["graphhighwaybyrel_1", 8, 0], ["inp_rel", 0, 0], ["inp_rel_mask", 0, 0]]], "name": "graphhighwaybyrel_1"}, {"class_name": "Dense", "config": {"W_constraint": null, "b_constraint": null, "name": "dense_2", "output_dim": 3, "activity_regularizer": null, "trainable": true, "init": "glorot_uniform", "bias": true, "input_dtype": "float32", "input_dim": 45, "b_regularizer": null, "W_regularizer": null, "activation": "linear", "batch_input_shape": [null, 45]}, "inbound_nodes": [[["graphhighwaybyrel_1", 9, 0]]], "name": "dense_2"}, {"class_name": "Activation", "config": {"activation": "softmax", "trainable": true, "name": "activation_1"}, "inbound_nodes": [[["dense_2", 0, 0]]], "name": "activation_1"}], "input_layers": [["inp_nodes", 0, 0], ["inp_rel", 0, 0], ["inp_rel_mask", 0, 0]], "output_layers": [["activation_1", 0, 0]], "name": "model_1"}}